This is my first pandas file as in jupyter notebook 
in this i will be first using pandas as well as making notes in pandas 
as this will be my first pandas program as well as im making notes of it and practicing pandas for the first time.

This is to import pandas and the "as" icluded in this just to give pandas a nickname  so wee dont have to call pnadas by full name instead we wirte pands as pd so that we can call it by using just pd "as" is to give it a nickname

In [2]:
import pandas as pd

There are two data structure in pandas (as there in python like set list and one more) so the two data structure are * Series 
                           * Data frames 
Altough there is a difference in list as there is a list in python so why do we use series in pands as the list in python is unlabled array and series is a labled array as every series in pandas has a index like (standing number)
(array is a data structure which is used to store multiple daata in  one variable)

This is the series making but mainly in pansas we use data frames

In [3]:
#  s is a variable in this for the starting name of series which makes easier to identify
s = pd.Series([1,2,3,4,5])
print(s)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In pandas in series we can change the index of our series

In [4]:
ser = pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
print(ser)

a    1
b    2
c    3
d    4
e    5
dtype: int64

And the second data type which is widely used is data frame is it is usually stored in df variable df is nothing just a variable as in series we use "[]"and he same in data frame we use "{}" and like series is a 1d data type whereas dataframe is a 2d data type

In [5]:
df = pd.DataFrame({"name": ["rishab", "prachi"]})

In [6]:
df

     name
0  rishab
1  prachi

The upper one is just for storing name whereas this is manly used for 2d data type so we can store multiple things in this data type so in this lets store some of the information about Rish Prac

In [7]:
data = pd.DataFrame({ "name": ["Rishab", "Prachi "], "age" : [20,19], "Fav_food": ["paneer chili " , "golgappa"] })
print(data)

      name  age       Fav_food
0   Rishab   20  paneer chili
1  Prachi    19       golgappa

This is to import the data from excel json or csv file so the function is called read like read is the kindof the name of the import and the data wherefver the data is from any source like excel csv or json all the data is stored in the form of a variable mainly the datatype which is dataframe mainly it is dataframe and mainly it stored in mainly the variable name is df so lets import (read) the command is "pd(pd for pandas) "pd.read_csv" this is the excel file but as csv extention

In [8]:
dff = pd.read_csv("dataa/rish.csv")

In [9]:
dff

    employee_number               name
0              6755        Chloe Pitts
1              6885    Ella Williamson
2              8471     Laurel Holland
3              7209        Cruz Tucker
4              5644  Hermione Calderon
..              ...                ...
68             8057    Serena Mcknight
69             7922     Rebekah Dennis
70             6226         Silas Bond
71             6700     Kaitlin Cotton
72             6045      Leandra Hardy

[73 rows x 2 columns]

There is further where you can utilize the data file that is stored in a variable for thsi case the variable name is dff These fucnrions are
* dff.head() #the dff is is a variable name . is for the added funtion where head is used for the top 5 by deffault where as the parenthesis takes the values so that u can put your desired number which you want in the parenthesis so that i will print that nmbr if you want the top 10 you can use this dff.head(10) it is to print whatever you want in the parenthesis whatever you want you want the desired number whatever you want you have to enter in the parenthis 
## this is to take note that in python as well as in pandas the number index starts from 0
variable.head(the number you want the index starts form 0 )

In [10]:
dff.head(8)

   employee_number               name
0             6755        Chloe Pitts
1             6885    Ella Williamson
2             8471     Laurel Holland
3             7209        Cruz Tucker
4             5644  Hermione Calderon
5             7405         Leigh Kerr
6             5692      Whilemina Ray
7             7948        Xyla Nguyen

As in pandas there is a head function there is also a tail funciton which is used for the last number the syntax is variable.tail(the number you want by default it is 5 )
it will give the same number in parenthesis although the index starts from zero and the main thing is the function doesnt print the in the parenthesis although the index starts from 0 and gives the number in the parenthesis but it doesnt print that number
### jitna chahiye utna dalo () isme mil jayega although the index starts from 0

In [11]:
dff.tail(8)

    employee_number               name
65             6334  Christian Marquez
66             5691      Edward Spence
67             6938     Griffin Valdez
68             8057    Serena Mcknight
69             7922     Rebekah Dennis
70             6226         Silas Bond
71             6700     Kaitlin Cotton
72             6045      Leandra Hardy

There is a function name (describe) which is use in to describe the file 
the syntaz is = variable.describe

In [12]:
dff.describe() # it usually describes the numbers in mathematical way like mean median mode

       employee_number
count        73.000000
mean       7302.315068
std        1024.349033
min        5556.000000
25%        6522.000000
50%        7277.000000
75%        8146.000000
max        8962.000000

Another function is (info) this function is used for getting the whole information about the entered file,
the syntax is variable.info()

In [13]:
dff.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 73 entries, 0 to 72
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   employee_number  73 non-null     int64
 1   name             73 non-null     object
dtypes: int64(1), object(1)
memory usage: 1.3+ KB

Data selection :- this funcion is used to print only one row or column
syntax is = variable[is used to take the thing inside] always use this with strring "" as this is to take the comun name if it is string then " is used

In [14]:
dff["name"] # this is to print the column [to take the input "this " because it is string and it is used with all the string "]

0           Chloe Pitts
1       Ella Williamson
2        Laurel Holland
3           Cruz Tucker
4     Hermione Calderon
            ...
68      Serena Mcknight
69       Rebekah Dennis
70           Silas Bond
71       Kaitlin Cotton
72        Leandra Hardy
Name: name, Length: 73, dtype: object

In [15]:
dff["employee_number"]

0     6755
1     6885
2     8471
3     7209
4     5644
      ...
68    8057
69    7922
70    6226
71    6700
72    6045
Name: employee_number, Length: 73, dtype: int64

If you want to have to select multiple comuln's data this function is use 
syntax = variable["column_name ,"column_ name]

In [ ]:
dff[["name" , "employee_number"]] #if you want to print two or multiple column you can  do it using this for
# you have to use two square bracket [[]]

                 name  employee_number
0         Chloe Pitts             6755
1     Ella Williamson             6885
2      Laurel Holland             8471
3         Cruz Tucker             7209
4   Hermione Calderon             5644
..                ...              ...
68    Serena Mcknight             8057
69     Rebekah Dennis             7922
70         Silas Bond             6226
71     Kaitlin Cotton             6700
72      Leandra Hardy             6045

[73 rows x 2 columns]

If you want to see the row data you can do it using this function 
syntax = variable.iloc[number of the row ]

In [27]:
dff.iloc[0]

employee_number           6755
name               Chloe Pitts
Name: 0, dtype: object

Now have look at data cleaaning mainly removing and clearing null values in pandas it is (Nan)
The two functions are dropna and fill na